# DATA WRANGLING

# Hierarchical Indexing

In [12]:
import pandas as pd
import numpy as np

In [2]:
s1=pd.Series(np.arange(9),
            index=[["a","a","a","b","b","b","c","c","c"],
            [1,2,4,5,4,3,2,2,3]])

In [3]:
s1

a  1    0
   2    1
   4    2
b  5    3
   4    4
   3    5
c  2    6
   2    7
   3    8
dtype: int32

In [4]:
s1.index

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3, 4, 5]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 3, 4, 3, 2, 1, 1, 2]])

In [5]:
s1["a"]

1    0
2    1
4    2
dtype: int32

In [6]:
s1[1]

1

In [7]:
s1["a"][4]

2

In [8]:
s1["b":"c"]

b  5    3
   4    4
   3    5
c  2    6
   2    7
   3    8
dtype: int32

In [9]:
s1.loc[["b","a"]]

a  1    0
   2    1
   4    2
b  5    3
   4    4
   3    5
dtype: int32

In [10]:
s1.loc[:,2]# in thisway we can select all 2 index of higher level

a    1
c    6
c    7
dtype: int32

In [11]:
s1.unstack()

ValueError: Index contains duplicate entries, cannot reshape

In [ ]:
 frame = pd.DataFrame(np.arange(12).reshape((4, 3)),   
                      index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],   
                      columns=[['Ohio', 'Ohio', 'Colorado'],   
                               ['Green', 'Red', 'Green']])

In [ ]:
frame

In [ ]:
frame.index

In [ ]:
frame.columns

In [ ]:
frame.index.names=["key1","key2"]
frame.columns.names=["state","color"]

In [ ]:
frame

In [ ]:
frame["Ohio"]

In [ ]:
frame["Colorado"]

In [ ]:
frame.iloc[1]

In [ ]:
frame

In [ ]:
frame.loc["a"]

In [ ]:
frame.loc["a",1]# in this way we can take "a" ka 1

In [ ]:
frame.loc["a":"b":2]

In [ ]:
frame["Ohio","Green"]# ohio kagreen

# Reordering and Sorting Levels

In [ ]:
frame.swaplevel("key1","key2")

In [ ]:
# by swaplevel we can interchange high level index to lowerlevel

In [ ]:
frame.sort_index(level=1)

In [ ]:
frame.sort_index(level=0)

In [ ]:
# by sort index we can sort the index

# Summary Statistics by Level

In [ ]:
frame

In [ ]:
frame.sum(level='key2')

In [ ]:
frame.sum(level='key1')

In [ ]:
frame.sum(level="color",axis=1)

In [ ]:
frame

# Indexing with a DataFrame’s columns

In [ ]:
 frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),   
                       'c': ['one', 'one', 'one', 'two', 'two',   
                             'two', 'two'],   
                       'd': [0, 1, 2, 0, 1, 2, 3]})

In [ ]:
frame

In [ ]:
frame.set_index(["c","d"])

In [ ]:
frame

In [ ]:
frame.set_index(["c","d"],drop=False)

In [ ]:
# by set_index we can reset index of dataframe ..we can use one or two columns as indexs 
# by default drop parameter is true which means that columns will removed but we want that col also 
# then we have to false the drop arg

In [ ]:
a=frame.reset_index()
a

In [ ]:
# it will conert index to col

# 2 Combining and Merging Datasets

In [ ]:
 df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],   
                     'data1': range(7)}) 
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],   
                    'data2': range(3)})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1,df2)

In [ ]:
# it will merge with the help of common vcolumns

In [ ]:
# only merge that values which are common in both df

In [ ]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],   
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],   
                     'data2': range(3)})

In [ ]:
 pd.merge(df3, df4, left_on='lkey', right_on='rkey')

In [ ]:
pd.merge(df1,df2,how="outer")

In [ ]:
pd.merge(df1,df2,how="left")

In [ ]:
pd.merge(df1,df2,how="right")

In [ ]:
# by using merge para we can we done merging by different ways

In [ ]:
# Outer:include all the values of common col
# inner :include all the common values of common col
# left :include all the common values and also left df values which are not common 
# right:include all the common values and also right df values which are not common

In [ ]:
 left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],   
                      'key2': ['one', 'two', 'one'],   
                      'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],   
                      'key2': ['one', 'one', 'one', 'two'],   
                      'rval': [4, 5, 6, 7]})
pd.merge(left, right, on=['key1', 'key2'], how='outer')

In [ ]:
left

In [ ]:
right

In [ ]:
 pd.merge(left, right, on='key1')

In [ ]:
left

In [ ]:
right

In [13]:
 left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],   
                       'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [14]:
right1

   group_val
a        3.5
b        7.0

In [15]:
pd.merge(left1,right1,left_on="key",right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [16]:
pd.merge(left1,right1,left_on="key",right_index=True,how="outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [17]:
pd.merge(left1,right1,left_on="key",right_index=True,how="right")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [18]:
 lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',   
                                'Nevada', 'Nevada'],
                       'key2': [2000, 2001, 2002, 2001, 2002],  
                       'data': np.arange(5.)})

In [19]:
 righth = pd.DataFrame(np.arange(12).reshape((6, 2)),   
                          index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',   
                                  'Ohio', 'Ohio'],   
                                 [2001, 2000, 2000, 2000, 2001, 2002]],   
                          columns=['event1', 'event2'])

In [20]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [21]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [23]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True,how="outer")

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [24]:
 left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],   
                      index=['a', 'c', 'e'],   
                      columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],   
                       index=['b', 'c', 'd', 'e'],  
                       columns=['Missouri', 'Alabama'])

In [33]:
left2.join(right2,how="inner")# join merge two dataframe by indexs of left dataframe
# by default how="left"

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [27]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [28]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [34]:
 another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],   
                        index=['a', 'c', 'e', 'f'],   
                        columns=['New York', 'Oregon'])

In [35]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [36]:
 left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [37]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [39]:
 left2.join([right2, another],how="outer")

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

# Concatenating Along an Axis